Repository: Subfly/yaba
Catalog: Darwin/YABA/Localizable.xcstrings
Source language: en
Languages: de, es, fr, hi, it, ja, ko, nb, nl, pt_br, sk, sv, tr, zh_hans

# Map HTML Info Section Text
source: Read before proceeding ✨ We couldn’t automatically read your HTML file — but don’t worry, you’re almost there! Most browsers like Chrome, Safari, and Firefox export bookmarks in a standard format that YABA supports. Just make sure you exported the file directly from your browser (usually via “Export Bookmarks” or “Export as HTML”). YABA expects links in this format: <DT><A HREF="https://example.com">Bookmark Title</A> Don’t forget that tags and icons are not exported to the HTML document!. 📄 Example of a supported HTML format: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Bookmarks</TITLE> <H1>Bookmarks</H1> <DT><H3>My Folder</H3> <DL><p> <DT><A HREF="https://example.com">Example Site</A> <DT><A HREF="https://another.com">Another Site</A> </DL><p> If your file looks similar to this and you're still seeing issues, try re-exporting and uploading again.
de: Bitte vor dem Fortfahren lesen ✨ Wir konnten deine HTML‑Datei nicht automatisch lesen – aber keine Sorge, du bist fast fertig! Die meisten Browser wie Chrome, Safari und Firefox exportieren Lesezeichen in einem Standardformat, das YABA unterstützt. Stelle nur sicher, dass du die Datei direkt aus deinem Browser exportiert hast (meist über „Lesezeichen exportieren“ oder „Als HTML exportieren“). YABA erwartet Links in folgendem Format: <DT><A HREF="https://example.com">Bookmark Title</A> Vergiss nicht, dass Tags und Icons nicht in das HTML‑Dokument exportiert werden! 📄 Beispiel für ein unterstütztes HTML‑Format: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Lesezeichen</TITLE> <H1>Lesezeichen</H1> <DT><H3>Mein Ordner</H3> <DL><p> <DT><A HREF="https://example.com">Beispielseite</A> <DT><A HREF="https://another.com">Weitere Seite</A> </DL><p> Wenn deine Datei so aussieht und du weiterhin Probleme hast, versuch, sie nochmal zu exportieren und hochzuladen.
es: Leer antes de continuar ✨ No pudimos leer tu archivo HTML automáticamente — pero no te preocupes, ¡ya casi está! La mayoría de los navegadores como Chrome, Safari y Firefox exportan los marcadores en un formato estándar que YABA admite. Asegúrate de haber exportado el archivo directamente desde tu navegador (normalmente mediante “Export Bookmarks” o “Export as HTML”). YABA espera enlaces en este formato: <DT><A HREF="https://example.com">Bookmark Title</A> No olvides que las etiquetas y los iconos no se exportan al documento HTML!. 📄 Ejemplo de un formato HTML compatible: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Bookmarks</TITLE> <H1>Bookmarks</H1> <DT><H3>My Folder</H3> <DL><p> <DT><A HREF="https://example.com">Example Site</A> <DT><A HREF="https://another.com">Another Site</A> </DL><p> Si tu archivo se parece a esto y sigues teniendo problemas, intenta volver a exportarlo y subirlo de nuevo.
fr: Lire avant de continuer ✨ Nous n’avons pas pu lire automatiquement ton fichier HTML — mais ne t’inquiète pas, tu y es presque ! La plupart des navigateurs comme Chrome, Safari et Firefox exportent les favoris dans un format standard pris en charge par YABA. Assure-toi simplement d’avoir exporté le fichier directement depuis ton navigateur (généralement via “Exporter les favoris” ou “Exporter en HTML”). YABA s’attend à des liens au format suivant : <DT><A HREF="https://example.com">Bookmark Title</A> N’oublie pas que les tags et les icônes ne sont pas exportés dans le document HTML!. 📄 Exemple d’un format HTML pris en charge : <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Bookmarks</TITLE> <H1>Bookmarks</H1> <DT><H3>My Folder</H3> <DL><p> <DT><A HREF="https://example.com">Example Site</A> <DT><A HREF="https://another.com">Another Site</A> </DL><p> Si ton fichier ressemble à ceci et que tu rencontres toujours des problèmes, essaie de réexporter puis de téléverser à nouveau.
hi: आगे बढ़ने से पहले पढ़ें ✨ हम आपकी HTML फ़ाइल को स्वतः पढ़ नहीं पाए — लेकिन चिंता न करें, आप लगभग तैयार हैं! अधिकतर ब्राउज़र जैसे Chrome, Safari, और Firefox बुकमार्क को एक मानक फ़ॉर्मैट में निर्यात करते हैं जिसे YABA सपोर्ट करता है। बस सुनिश्चित करें कि आपने फ़ाइल सीधे अपने ब्राउज़र से निर्यात की है (आम तौर पर “Export Bookmarks” या “Export as HTML” के माध्यम से)। YABA निम्नलिखित फ़ॉर्मैट में लिंक की अपेक्षा करता है: <DT><A HREF="https://example.com">Bookmark Title</A> ध्यान रखें कि टैग और आइकन HTML दस्तावेज़ में निर्यात नहीं होते हैं!. 📄 समर्थित HTML फ़ॉर्मैट का उदाहरण: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>बुकमार्क</TITLE> <H1>बुकमार्क</H1> <DT><H3>मेरा फ़ोल्डर</H3> <DL><p> <DT><A HREF="https://example.com">उदाहरण साइट</A> <DT><A HREF="https://another.com">एक और साइट</A> </DL><p> यदि आपकी फ़ाइल इस तरह दिखती है और फिर भी समस्या आ रही है, तो पुनः निर्यात करके फिर से अपलोड करने का प्रयास करें.
it: Leggi prima di procedere ✨ Non siamo riusciti a leggere automaticamente il tuo file HTML — ma non preoccuparti, sei quasi arrivato! La maggior parte dei browser come Chrome, Safari e Firefox esportano i segnalibri in un formato standard supportato da YABA. Assicurati solo di aver esportato il file direttamente dal tuo browser (di solito tramite “Esporta segnalibri” o “Esporta come HTML”). YABA si aspetta link in questo formato: <DT><A HREF="https://example.com">Bookmark Title</A> Non dimenticare che tag e icone non vengono esportati nel documento HTML!. 📄 Esempio di un formato HTML supportato: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Bookmarks</TITLE> <H1>Bookmarks</H1> <DT><H3>My Folder</H3> <DL><p> <DT><A HREF="https://example.com">Example Site</A> <DT><A HREF="https://another.com">Another Site</A> </DL><p> Se il tuo file è simile a questo e continui a vedere problemi, prova a riesportarlo e caricarlo di nuovo.
ja: 進める前にお読みください ✨ HTML ファイルを自動で読み取れませんでした — でも心配いりません、もうすぐ完了です！Chrome、Safari、Firefox などのほとんどのブラウザは、YABA が対応している標準形式でブックマークをエクスポートします。 ブラウザから直接ファイルをエクスポートしたことを確認してください（通常は「ブックマークをエクスポート」や「HTML としてエクスポート」など）。YABA は次の形式のリンクを想定しています： <DT><A HREF="https://example.jp">Bookmark Title</A> タグやアイコンは HTML ドキュメントにエクスポートされないことをお忘れなく。 📄 対応している HTML 形式の例： <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Bookmarks</TITLE> <H1>Bookmarks</H1> <DT><H3>My Folder</H3> <DL><p> <DT><A HREF="https://example.jp">Example Site</A> <DT><A HREF="https://another.jp">Another Site</A> </DL><p> ファイルがこの例と似ているのに問題が続く場合は、再度エクスポートしてアップロードし直してみてください。
ko: 계속하기 전에 읽어보세요 ✨ HTML 파일을 자동으로 읽을 수 없었습니다 — 걱정하지 마세요, 거의 완료되었습니다! 대부분의 브라우저(예: Chrome, Safari, Firefox)는 YABA가 지원하는 표준 형식으로 북마크를 내보냅니다. 브라우저에서 직접 파일을 내보냈는지(보통 “북마크 내보내기” 또는 “HTML로 내보내기”를 통해) 확인하세요. YABA는 다음과 같은 형식의 링크를 기대합니다: <DT><A HREF="https://example.kr">Bookmark Title</A> 태그와 아이콘은 HTML 문서로 내보내지지 않는다는 점을 잊지 마세요! 📄 지원되는 HTML 형식의 예: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Bookmarks</TITLE> <H1>Bookmarks</H1> <DT><H3>내 폴더</H3> <DL><p> <DT><A HREF="https://example.kr">예시 사이트</A> <DT><A HREF="https://another.kr">다른 사이트</A> </DL><p> 파일이 이와 비슷한데도 문제가 계속 발생하면, 다시 내보내기하여 업로드해 보세요.
nb: Les før du fortsetter ✨ Vi klarte ikke å lese HTML-filen din automatisk — men ikke bekymre deg, du er nesten i mål! De fleste nettlesere som Chrome, Safari og Firefox eksporterer bokmerker i et standardformat som YABA støtter. Sørg bare for at du eksporterte filen direkte fra nettleseren din (vanligvis via “Export Bookmarks” eller “Export as HTML”). YABA forventer lenker i dette formatet: <DT><A HREF="https://example.com">Bookmark Title</A> Ikke glem at tags og ikoner ikke eksporteres til HTML-dokumentet!. 📄 Eksempel på et støttet HTML-format: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Bookmarks</TITLE> <H1>Bookmarks</H1> <DT><H3>My Folder</H3> <DL><p> <DT><A HREF="https://example.com">Example Site</A> <DT><A HREF="https://another.com">Another Site</A> </DL><p> Hvis filen din ligner dette og du fortsatt får problemer, prøv å eksportere på nytt og laste opp igjen.
nl: Lees dit voordat je doorgaat ✨ We konden je HTML-bestand niet automatisch lezen — geen zorgen, je bent er bijna! De meeste browsers, zoals Chrome, Safari en Firefox, exporteren bladwijzers in een standaardformaat dat YABA ondersteunt. Zorg er gewoon voor dat je het bestand direct vanuit je browser hebt geëxporteerd (meestal via “Bladwijzers exporteren” of “Exporteren als HTML”). YABA verwacht links in dit formaat: <DT><A HREF="https://example.com">Bookmark Title</A> Vergeet niet dat tags en pictogrammen niet naar het HTML-document worden geëxporteerd!. 📄 Voorbeeld van een ondersteund HTML-formaat: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Bookmarks</TITLE> <H1>Bookmarks</H1> <DT><H3>My Folder</H3> <DL><p> <DT><A HREF="https://example.com">Example Site</A> <DT><A HREF="https://another.com">Another Site</A> </DL><p> Als je bestand er ongeveer zo uitziet en je nog steeds problemen ziet, probeer het dan opnieuw te exporteren en opnieuw te uploaden.
pt_br: Leia antes de continuar ✨ Não foi possível ler automaticamente o seu arquivo HTML — mas não se preocupe, você está quase lá! A maioria dos navegadores, como Chrome, Safari e Firefox, exporta favoritos em um formato padrão que o YABA suporta. Apenas verifique se você exportou o arquivo diretamente do seu navegador (normalmente via “Exportar favoritos” ou “Exportar como HTML”). O YABA espera links neste formato: <DT><A HREF="https://example.com">Título do favorito</A> Não esqueça que tags e ícones não são exportados para o documento HTML!. 📄 Exemplo de um formato HTML compatível: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Favoritos</TITLE> <H1>Favoritos</H1> <DT><H3>Minha Pasta</H3> <DL><p> <DT><A HREF="https://example.com">Site de Exemplo</A> <DT><A HREF="https://another.com">Outro Site</A> </DL><p> Se o seu arquivo se parece com este e você ainda está enfrentando problemas, tente exportar novamente e fazer o upload de novo.
sk: Prečítaj si pred pokračovaním ✨ Nepodarilo sa nám automaticky načítať tvoj HTML súbor — ale neboj, si takmer hotový! Väčšina prehliadačov ako Chrome, Safari a Firefox exportuje záložky v štandardnom formáte, ktorý YABA podporuje. Iba sa uisti, že si súbor exportoval priamo z prehliadača (zvyčajne cez „Export Bookmarks“ alebo „Export as HTML“). YABA očakáva odkazy v tomto formáte: <DT><A HREF="https://example.com">Bookmark Title</A> Nezabudni, že štítky a ikony sa do HTML dokumentu neexportujú!. 📄 Príklad podporovaného HTML formátu: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Záložky</TITLE> <H1>Záložky</H1> <DT><H3>Môj priečinok</H3> <DL><p> <DT><A HREF="https://example.com">Príklad stránka</A> <DT><A HREF="https://another.com">Iná stránka</A> </DL><p> Ak tvoj súbor vyzerá podobne a stále sa vyskytujú problémy, skúšaj ho znova exportovať a nahrať.
sv: Läs innan du fortsätter ✨ Vi kunde inte automatiskt läsa din HTML-fil — men oroa dig inte, du är nästan klar! De flesta webbläsare som Chrome, Safari och Firefox exporterar bokmärken i ett standardformat som YABA stödjer. Se bara till att du exporterade filen direkt från din webbläsare (vanligtvis via “Exportera bokmärken” eller “Exportera som HTML”). YABA förväntar sig länkar i det här formatet: <DT><A HREF="https://example.com">Bookmark Title</A> Glöm inte att taggar och ikoner inte exporteras till HTML-dokumentet!. 📄 Exempel på ett stödjat HTML-format: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Bookmarks</TITLE> <H1>Bookmarks</H1> <DT><H3>My Folder</H3> <DL><p> <DT><A HREF="https://example.com">Example Site</A> <DT><A HREF="https://another.com">Another Site</A> </DL><p> Om din fil liknar detta och du fortfarande får problem, försök att exportera om och ladda upp igen.
tr: Devam etmeden önce oku ✨ HTML dosyanı otomatik olarak okuyamadık — ama merak etme, neredeyse bitirdin! Chrome, Safari ve Firefox gibi çoğu tarayıcı, YABA’nın desteklediği standart bir formatta yer imlerini dışa aktarır. Dosyayı tarayıcından doğrudan dışa aktardığından emin ol (genellikle “Yer İmlerini Dışa Aktar” veya “HTML olarak Dışa Aktar” aracılığıyla). YABA şu formatta bağlantılar bekler: <DT><A HREF="https://example.com">Bookmark Title</A> Etiketlerin ve simgelerin HTML belgesine aktarılmadığını unutma!. 📄 Desteklenen bir HTML formatı örneği: <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Bookmarks</TITLE> <H1>Bookmarks</H1> <DT><H3>My Folder</H3> <DL><p> <DT><A HREF="https://example.com">Example Site</A> <DT><A HREF="https://another.com">Another Site</A> </DL><p> Dosyan bu örneğe benziyorsa ve hâlâ sorun yaşıyorsan, yeniden dışa aktarım yapıp tekrar yüklemeyi dene.
zh_hans: 在继续之前请阅读 ✨ 我们无法自动读取你的 HTML 文件——别担心，你快完成了！大多数浏览器（如 Chrome、Safari 和 Firefox）以 YABA 支持的标准格式导出书签。 只需确保你是直接从浏览器导出的文件（通常通过“导出书签”或“导出为 HTML”）。YABA 期待链接为以下格式： <DT><A HREF="https://example.com">Bookmark Title</A> 别忘了标签和图标不会被导出到 HTML 文档中！. 📄 支持的 HTML 示例格式： <!DOCTYPE NETSCAPE-Bookmark-file-1> <HTML> <TITLE>Bookmarks</TITLE> <H1>Bookmarks</H1> <DT><H3>My Folder</H3> <DL><p> <DT><A HREF="https://example.com">Example Site</A> <DT><A HREF="https://another.com">Another Site</A> </DL><p> 如果你的文件看起来类似但仍然出现问题，试着重新导出然后再次上传。

source: Map HTML Label
de: HTML-Label der Karte
es: Etiqueta HTML del mapa
fr: Étiquette HTML de la carte
hi: HTML लेबल मानचित्रित करें
it: Etichetta HTML della mappa
ja: HTML ラベルをマップに表示
ko: HTML 지도 레이블
nb: Kart HTML-etikett
nl: HTML-label kaart
pt_br: Mapa do rótulo HTML
sk: Mapovať HTML štítok
sv: Kartlägg HTML-etikett
tr: Harita HTML Etiketi
zh_hans: 地图 HTML 标签

# Map JSON Info Section Text
source: Read before proceeding ✨ We couldn’t parse your JSON file automatically — but don’t worry, you’re very close! While we couldn’t match the structure upfront, you can still ensure it’s importable by following the expected format below. Your bookmarks (and even collections!) will be imported and organized smartly. If no collections are present, we’ll neatly place all bookmarks inside a folder named with the current date and time. The only required field is the link. If label is missing, we’ll default it to using the link. For missing timestamps, we’ll use the current time. You don’t need to include every field — we’ll gracefully handle missing optional ones. If your JSON follows the structure below, you're good to go!
de: Bitte lesen, bevor du fortfährst ✨ Wir konnten deine JSON-Datei nicht automatisch parsen – aber keine Sorge, du bist ganz nah dran! Auch wenn wir die Struktur nicht auf Anhieb erkennen konnten, kannst du sicherstellen, dass sie importierbar ist, indem du das untenstehende erwartete Format einhältst. Deine Lesezeichen (und sogar Sammlungen!) werden smart importiert und organisiert. Falls keine Sammlungen vorhanden sind, packen wir alle Lesezeichen ordentlich in einen Ordner, der nach dem aktuellen Datum und der Uhrzeit benannt wird. Das einzige Pflichtfeld ist der Link. Falls ein Label fehlt, verwenden wir standardmäßig den Link als Bezeichnung. Bei fehlenden Zeitstempeln nehmen wir die aktuelle Zeit. Du musst nicht alle Felder einschließen – fehlende optionale Felder behandeln wir elegant. Wenn deine JSON der untenstehenden Struktur folgt, bist du startklar!
es: Lee antes de continuar ✨ No pudimos analizar automáticamente tu archivo JSON, pero no te preocupes, ¡estás muy cerca! Aunque no pudimos identificar la estructura inicialmente, todavía puedes asegurarte de que sea importable siguiendo el formato esperado que aparece a continuación. Tus favoritos (¡y hasta las colecciones!) se importarán y organizarán de forma inteligente. Si no hay colecciones, colocaremos todos los favoritos dentro de una carpeta nombrada con la fecha y hora actuales. El único campo obligatorio es el enlace. Si falta la etiqueta, usaremos por defecto el enlace. Para marcas de tiempo faltantes, utilizaremos la hora actual. No necesitas incluir todos los campos; manejaremos con gracia los opcionales que falten. Si tu JSON sigue la estructura que se muestra abajo, ¡puedes continuar!
fr: À lire avant de continuer ✨ Nous n'avons pas pu analyser automatiquement votre fichier JSON — mais ne vous inquiétez pas, vous êtes très proche du but ! Bien que nous n'ayons pas pu correspondre à la structure dès le départ, vous pouvez toujours vous assurer qu'il est importable en suivant le format attendu ci-dessous. Vos favoris (et même vos collections !) seront importés et organisés intelligemment. S'il n'y a pas de collections présentes, nous placerons soigneusement tous les favoris dans un dossier nommé avec la date et l'heure actuelles. Le seul champ obligatoire est le lien. Si le label est manquant, nous utiliserons par défaut le lien. Pour les horodatages manquants, nous utiliserons l'heure actuelle. Vous n'avez pas besoin d'inclure tous les champs — nous gérerons élégamment ceux qui sont optionnels et absents. Si votre JSON suit la structure ci-dessous, vous êtes prêt à partir !
hi: आगे बढ़ने से पहले पढ़ें ✨ हम आपकी JSON फ़ाइल को स्वचालित रूप से पार्स नहीं कर पाए — लेकिन चिंता न करें, आप बहुत करीब हैं! हालांकि हम प्रारंभ में संरचना से मेल नहीं खा पाए, फिर भी आप नीचे दिए गए अपेक्षित प्रारूप का पालन करके इसे आयात योग्य सुनिश्चित कर सकते हैं। आपके बुकमार्क (यहाँ तक कि संग्रह भी!) स्मार्ट तरीके से आयात और व्यवस्थित किए जाएंगे। यदि कोई संग्रह मौजूद नहीं है, तो हम सभी बुकमार्क को वर्तमान दिनांक और समय के नाम वाले एक फ़ोल्डर में सौप देंगे। केवल लिंक फ़ील्ड आवश्यक है। यदि लेबल गायब है, तो हम इसे लिंक के रूप में ही सेट कर देंगे। जो टाइमस्टैम्प्स गायब हैं, उनके लिए हम वर्तमान समय का उपयोग करेंगे। आपको हर फ़ील्ड शामिल करने की आवश्यकता नहीं है — हम वैकल्पिक फ़ील्ड्स के अभाव को सहजता से संभाल लेंगे। यदि आपकी JSON नीचे दी गई संरचना का पालन करती है, तो आप तैयार हैं!
it: Leggi prima di procedere ✨ Non siamo riusciti a interpretare automaticamente il tuo file JSON, ma non preoccuparti, sei molto vicino! Anche se non abbiamo potuto associare subito la struttura, puoi comunque assicurarti che sia importabile seguendo il formato previsto qui sotto. I tuoi segnalibri (e persino le raccolte!) verranno importati e organizzati in modo intelligente. Se non sono presenti raccolte, posizioneremo ordinatamente tutti i segnalibri in una cartella nominata con la data e l’ora attuali. L’unico campo obbligatorio è il link. Se manca l’etichetta, useremo come predefinito il link. Per i timestamp mancanti, utilizzeremo l’ora corrente. Non è necessario includere ogni campo: gestiremo con grazia quelli opzionali assenti. Se il tuo JSON segue la struttura indicata qui sotto, sei a posto!
ja: 進む前にお読みください✨ JSONファイルを自動で解析できませんでしたが、ご安心ください、ほぼできています！構造がすぐには合いませんでしたが、以下の期待される形式に従えばインポート可能です。 ブックマークやコレクションも賢くインポート・整理されます。コレクションがなければ、現在の日付と時刻で名前を付けたフォルダにすべてのブックマークをまとめます。 必須なのはリンクだけです。ラベルがなければリンクを使います。タイムスタンプがなければ現在時刻を使用します。 すべての項目を含める必要はなく、オプションの項目が欠けていても問題ありません。以下の構造に従っていれば準備完了です！
ko: 진행하기 전에 읽어주세요 ✨ JSON 파일을 자동으로 분석하지 못했습니다. 하지만 걱정하지 마세요, 거의 다 왔습니다! 처음에는 구조를 맞출 수 없었지만, 아래 예상 형식을 따르면 가져오기가 가능합니다. 북마크(와 컬렉션!)가 스마트하게 가져와져 정리됩니다. 컬렉션이 없으면 현재 날짜와 시간으로 이름 지어진 폴더 안에 모든 북마크를 깔끔히 넣습니다. 필수 항목은 링크뿐입니다. 레이블이 없으면 링크를 기본값으로 사용합니다. 타임스탬프가 없으면 현재 시간을 사용합니다. 모든 필드를 포함할 필요는 없습니다 — 선택적 항목이 없어도 문제없이 처리합니다. 아래 구조를 따르시면 준비가 완료됩니다!
nb: Les dette før du fortsetter ✨ Vi kunne ikke automatiske lese JSON-filen din — men ikke bekymre deg, du er veldig nær! Selv om vi ikke kunne matche strukturen med en gang, kan du fortsatt sørge for at den kan importeres ved å følge forventet format nedenfor. Bokmerkene dine (og til og med samlinger!) vil bli importert og organisert smart. Hvis det ikke finnes samlinger, plasserer vi alle bokmerkene pent i en mappe med dagens dato og klokkeslett. Det eneste obligatoriske feltet er lenken. Hvis etiketten mangler, bruker vi lenken som standard. Ved manglende tidsstempel bruker vi nåværende tid. Du trenger ikke å inkludere alle felt — vi håndterer valgfri manglende informasjon på en ryddig måte. Hvis JSON-en din følger strukturen nedenfor, er du klar til å gå!
nl: Lees dit voordat je verdergaat ✨ We konden je JSON-bestand niet automatisch parseren — maar maak je geen zorgen, je bent heel dicht bij! Hoewel we de structuur niet direct konden matchen, kun je nog steeds zorgen dat het geïmporteerd kan worden door het onderstaande verwachte formaat te volgen. Je bladwijzers (en zelfs collecties!) worden geïmporteerd en slim georganiseerd. Als er geen collecties aanwezig zijn, plaatsen we netjes alle bladwijzers in een map met de huidige datum en tijd als naam. Het enige verplichte veld is de link. Als het label ontbreekt, gebruiken we standaard de link als label. Voor ontbrekende tijdstempels gebruiken we de huidige tijd. Je hoeft niet elk veld op te nemen — we gaan netjes om met ontbrekende optionele velden. Als je JSON de onderstaande structuur volgt, ben je klaar om te gaan!
pt_br: Leia antes de continuar ✨ Não conseguimos analisar seu arquivo JSON automaticamente — mas não se preocupe, você está muito perto! Embora não tenhamos correspondido à estrutura inicialmente, você ainda pode garantir que ele seja importável seguindo o formato esperado abaixo. Seus favoritos (e até coleções!) serão importados e organizados de forma inteligente. Se não houver coleções, colocaremos todos os favoritos em uma pasta nomeada com a data e hora atual. O único campo obrigatório é o link. Se o rótulo estiver ausente, usaremos o link como padrão. Para timestamps ausentes, usaremos a hora atual. Você não precisa incluir todos os campos — lidaremos com os opcionais ausentes sem problemas. Se seu JSON seguir a estrutura abaixo, está tudo pronto!
sk: Prečítaj si pred pokračovaním ✨ Automaticky sa nám nepodarilo spracovať tvoj JSON súbor — ale neboj sa, si veľmi blízko! Aj keď sme na prvý pohľad nenašli zhodu so štruktúrou, môžeš si byť istý, že import bude fungovať, ak budeš nasledovať očakávaný formát nižšie. Tvoje záložky (a dokonca aj kolekcie!) budú importované a inteligentne usporiadané. Ak nebudú nájdené žiadne kolekcie, všetky záložky umiestnime do priečinka pomenovaného podľa aktuálneho dátumu a času. Jediné povinné pole je odkaz. Ak chýba názov, predvolene použijeme samotný odkaz. Pri chýbajúcom časovom označení použijeme aktuálny čas. Nemusíš uvádzať všetky polia — voliteľné polia, ktoré chýbajú, spracujeme bez problémov. Ak je tvoj JSON podľa nižšie uvedenej štruktúry, si pripravený!
sv: Läs innan du fortsätter ✨ Vi kunde inte automatiskt tolka din JSON-fil — men oroa dig inte, du är väldigt nära! Även om vi inte kunde matcha strukturen direkt kan du fortfarande säkerställa att den kan importeras genom att följa det förväntade formatet nedan. Dina bokmärken (och till och med samlingar!) kommer att importeras och organiseras smart. Om inga samlingar finns, placerar vi snyggt alla bokmärken i en mapp namngiven med aktuellt datum och tid. Det enda obligatoriska fältet är länken. Om etikett saknas använder vi länken som standard. För saknade tidsstämplar använder vi aktuell tid. Du behöver inte inkludera alla fält — vi hanterar saknade valfria fält smidigt. Om din JSON följer strukturen nedan är du redo att köra!
tr: Devam etmeden önce okuyun ✨ JSON dosyanızı otomatik olarak çözemedik — ama endişelenmeyin, çok yakınsınız! Yapıyı önceden eşleştiremesek de, aşağıdaki beklenen formatı takip ederek dosyanızın içe aktarılabilir olduğundan emin olabilirsiniz. Yer imleriniz (hatta koleksiyonlarınız!) akıllıca içe aktarılacak ve düzenlenecek. Koleksiyon yoksa, tüm yer imlerini tarih ve saatle adlandırılmış bir klasöre düzenleyeceğiz. Tek gerekli alan bağlantıdır. Etiket eksikse, varsayılan olarak bağlantıyı kullanacağız. Zaman damgası eksikse, mevcut zamanı kullanacağız. Her alanı dahil etmeniz gerekmez — eksik isteğe bağlı alanları da sorunsuz şekilde işleyeceğiz. JSON yapınız aşağıdakine uygunsa, hazırsınız!
zh_hans: 继续操作前请阅读 ✨ 我们无法自动解析您的 JSON 文件——但别担心，您已经很接近了！虽然我们无法预先匹配结构，但您仍可以通过遵循以下期望格式，确保其可导入。 您的书签（甚至收藏夹！）将被智能导入和整理。如果没有收藏夹，我们会将所有书签整齐地放入以当前日期和时间命名的文件夹中。 唯一必需的字段是链接。如果缺少标签，我们会默认使用链接。对于缺少时间戳的情况，我们会使用当前时间。 您无需包含每个字段——我们会优雅地处理缺失的可选字段。如果您的 JSON 符合以下结构，您就可以开始导入了！
